** Clocking work time
   :PROPERTIES:
   :CUSTOM_ID: code-block-org-clock
   :END:
Org mode allows you to clock the time you spend on specific tasks in a project. When you start working on an item, you can start the clock. When you stop working on that task, or when you mark the task done, the clock is stopped and the corresponding time interval is recorded. It also computes the total time spent on each subtree1 of a project. And it remembers a history or tasks recently clocked, so that you can jump quickly between a number of tasks absorbing your time.

To save the clock history across Emacs sessions, use

#+BEGIN_SRC emacs-lisp
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)
#+END_SRC

#+RESULTS:
| org-clock-save | org-babel-remove-temporary-directory |

** module
#+NAME: module
#+BEGIN_SRC elisp  :var filename = ""
  (last
   (split-string
    (replace-regexp-in-string "/" " "   (expand-file-name filename)) ))
#+END_SRC

#+RESULTS: module
| org |

** Send data to PIPE
   CLOCK: [2016-01-13 Wed 05:47]--[2016-01-13 Wed 05:58] =>  0:11
   :PROPERTIES:
   :Effort:   0:10
   :END:
#+NAME: cmdaync
#+BEGIN_SRC sh :var cmd="" :var mod=module[0] :noweb yes
  <<check_pipeserver_running>>
  echo  $cmd   > $pipe
#+END_SRC

#+RESULTS:
: command npm adduser is sended to /tmp/friends-aneesha

*** check_pipeserver_running
#+NAME: check_pipeserver_running
#+BEGIN_SRC sh
  pipe="/tmp/"$mod
  [ ! -p $pipe ] && exit 1 || echo "command $DT is sended to $pipe"
#+END_SRC

#+RESULTS: check_pipeserver_running
: command  is sended to /tmp/friends-aneesha

** Output file to string
#+name: fread
#+BEGIN_SRC elisp :var filename=""
    (with-temp-buffer
      (insert-file-contents filename)
      (buffer-string))
#+END_SRC

#+RESULTS:
: # friends-aneesha

* Send data to PIPE
   CLOCK: [2016-01-13 Wed 05:47]--[2016-01-13 Wed 05:58] =>  0:11
   :PROPERTIES:
   :Effort:   0:10
   :END:
#+NAME: cmdaync
#+BEGIN_SRC sh :var cmd="" :var mod=module[0] :noweb yes
<<check_pipeserver_running>>
echo  $cmd   > $pipe
#+END_SRC

#+RESULTS:
: command npm adduser is sended to /tmp/friends-aneesha

*** check_pipeserver_running
#+NAME: check_pipeserver_running
#+BEGIN_SRC sh
pipe="/tmp/"$mod
[ ! -p $pipe ] && exit 1 || echo "command $DT is sended to $pipe"
#+END_SRC

#+RESULTS: check_pipeserver_running
: command  is sended to /tmp/friends-aneesha
